app/Controllers/AdministradorController.php

SELECT *
FROM `usuarios`
WHERE `activo` = 1
---
    public function index()
    {
        $data['usuarios'] = $this->usuarioModel->where('activo', 1)->findAll();

SELECT *
FROM `productos`
---
    public function productos()
    {
        $productoModel = new ProductoModel();
        $productos = $productoModel->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'
---
    public function producto_edit($id)
    {
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($id);

SELECT *
FROM `consultas`
WHERE `consultas`.`id` = '2'
---
public function responder_consulta($id)
{
    log_message('debug', 'Entré a responder_consulta con método: ' . $this->request->getMethod());

    $consultaModel = new \App\Models\ConsultaModel();
    $consulta = $consultaModel->find($id);