app/Controllers/AuthController.php

       public function processLogin()
        {
            $email = trim(strtolower($this->request->getPost('email')));
            $password = $this->request->getPost('password');

            // Buscar al usuario por email
            $user = $this->usuarioModel
                ->where('email', $email)
                ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'ingrid@gmail.com'
 LIMIT 1