app/Controllers/PedidosController.php

    public function detallePedido($id)
    {
        $usuarioId = session()->get('id_usuario');
        $factura = $this->facturaModel->find($id);

        if (!$factura || $factura['usuario_id'] != $usuarioId) {
            return redirect()->to('/mis-pedidos')->with('error', 'Pedido no encontrado');
        }

        $detalles = $this->detalleFacturaModel->select('detalle_factura.*, productos.nombre, productos.imagen')
                                            ->join('productos', 'productos.id = detalle_factura.producto_id')
                                            ->where('factura_id', $id)
                                            ->findAll();
---
SELECT *
FROM `facturas`
WHERE `facturas`.`id` = '4'
SELECT `detalle_factura`.*, `productos`.`nombre`, `productos`.`imagen`
FROM `detalle_factura`
JOIN `productos` ON `productos`.`id` = `detalle_factura`.`producto_id`
WHERE `factura_id` = '4'