app/Controllers/ProfileController.php

SELECT *
FROM `direcciones`
WHERE `id_usuario` = '15'
---
    public function index()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userId = $session->get('id_usuario');

        $data = [
            'title' => 'Mi Perfil',
            'usuario' => [
                'id_usuario' => $userId,
                'nombre' => $session->get('nombre'),
                'email' => $session->get('email'),
                'celular' => $session->get('celular'),
            ],
            'direcciones' => $this->direccionesModel->where('id_usuario', $userId)->findAll()

UPDATE `usuarios` SET `nombre` = 'kiara guillen valentina', `email` = 'kiara@gmail.coma', `celular` = '3777123123123', `updated_at` = '2025-06-03 08:05:51'
WHERE `usuarios`.`id_usuario` IN ('11')
---
     public function actualizarPerfil()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userId = $session->get('id_usuario');

        // Validar los datos del formulario
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[50]',
            'email' => 'required|valid_email|max_length[100]',
            'celular' => 'permit_empty|max_length[20]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Preparar los datos para actualizar
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'celular' => $this->request->getPost('celular') // Corregido: 'celular' no 'celular'
        ];

        // Actualizar en la base de datos (nota: minúscula "u")
        if ($this->usuarioModel->update($userId, $data)) {