app/Models/CarritoModel.php

    public function getCarritoPorUsuario($user_id)
    {
        return $this->select('carrito.*, productos.nombre, productos.precio')
                    ->join('productos', 'productos.id = carrito.producto_id')
                    ->where('user_id', $user_id)
                    ->findAll();
---
SELECT `carrito`.*, `productos`.`nombre`, `productos`.`precio`
FROM `carrito`
JOIN `productos` ON `productos`.`id` = `carrito`.`producto_id`
WHERE `user_id` IS NULL